OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../Inputs"
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($UX $UZ 0);

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    airfoil
    {
        type            noSlip;
    }

    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
