OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          355840;
        startFace       354816;
    }
    farfield
    {
        type            patch;
        nFaces          1646;
        startFace       710656;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          402;
        startFace       712302;
    }
)

// ************************************************************************* //
