OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../Inputs"
// Air temperature at standard atmospheric pressure = 540 R = 300 K
// See README.md
// c = 347.336 [m/s]
// Ma = UInf/c = 0.15
// UInf = 52.1004 [m/s]
// ReChord = 6e6 (per chord)
// Chord = 1 [m]
// ReChord = UInf*Chord/nuFluid
// nuFluid = UInf*Chord/ReChord = 8.6834e-06 [m2/s]

transportModel  Newtonian;

nu              $NU;


// ************************************************************************* //
