OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (41.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (41.0 10.0 0)
    (41.0 0.1 0)
    (41.0 0.0 0)
    (41.0 -0.1 0)
    (1.013870041792304 0.09903343849771014 0)
    (1.0 0.0 0)
    (1.013870041792304 -0.09903343849771014 0)
    (0.24721590430844828 0.1593261449982662 0)
    (0.25 0.05936490845539281 0)
    (0.25 -0.05936490845539281 0)
    (0.2527840956915517 -0.1593261449982662 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (41.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (41.0 10.0 1)
    (41.0 0.1 1)
    (41.0 0.0 1)
    (41.0 -0.1 1)
    (1.013870041792304 0.09903343849771014 1)
    (1.0 0.0 1)
    (1.013870041792304 -0.09903343849771014 1)
    (0.24721590430844828 0.1593261449982662 1)
    (0.25 0.05936490845539281 1)
    (0.25 -0.05936490845539281 1)
    (0.2527840956915517 -0.1593261449982662 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (494 91 1) simpleGrading (170.05767613817727 454.8453319822253 454.8453319822253 170.05767613817727 0.012162813885540929 0.012162813885540929 0.012162813885540929 0.012162813885540929 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (172 91 1) simpleGrading (0.0819091073380565 0.27498537064287126 0.27498537064287126 0.0819091073380565 0.012328714781595747 0.012162813885540929 0.012162813885540929 0.012328714781595747 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.012162813885540929 0.012328714781595747 0.012328714781595747 0.012162813885540929 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.012162813885540929 0.012328942006051185 0.012328942006051185 0.012162813885540929 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (168 91 1) edgeGrading (0.22261732846111462 0.0819091073380565 0.0819091073380565 0.22261732846111462 81.10996057157124 82.21781648642946 82.21781648642946 81.10996057157124 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (494 91 1) simpleGrading (454.8453319822253 170.05767613817727 170.05767613817727 454.8453319822253 82.21781648642946 82.21781648642946 82.21781648642946 82.21781648642946 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (494 37 1) simpleGrading (454.8453319822253 6.081406942770463 1) 
    hex (15 12 11 14 34 31 30 33) (168 37 1) egeeGrading (0.1 0.22261732846111462 0.22261732846111462 0.1 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2 0.5 0.5 2 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2 2 0.5 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (172 37 1) edgeGrading (0.27498537064287126 0.1 0.1 0.27498537064287126 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (494 37 1) simpleGrading (454.8453319822253 0.16443563297285893 1) 
);

edges
(
    polyLine 11 14
    (
        (1.0128830417923043 0.10043143849771013 0)
        (1.0098766031911464 0.10085248953654893 0)
        (1.00487582744531 0.10154869766650595 0)
        (0.9979063623920071 0.10251191105013269 0)
        (0.9890042262308285 0.10372979605267005 0)
        (0.9781976137475837 0.10519231319640823 0)
        (0.9655295662600601 0.10688217867195594 0)
        (0.9510525821965343 0.10878351370906257 0)
        (0.9348268800580242 0.11087601735791014 0)
        (0.9169184223384946 0.11314091881430258 0)
        (0.8973967079232174 0.11555740243490337 0)
        (0.8763394012251621 0.11810376049515617 0)
        (0.8538319532626815 0.12075882289512889 0)
        (0.8299586823961097 0.12350054802888694 0)
        (0.8048156602891436 0.12630668757223373 0)
        (0.7784953147364092 0.12915549664400391 0)
        (0.7511042451482106 0.13202264252960824 0)
        (0.7227423851616899 0.13488746897091727 0)
        (0.6935138593460537 0.1377243096412254 0)
        (0.6635354101045848 0.14050869577230643 0)
        (0.6329161988597679 0.14321699561439244 0)
        (0.6017646896443494 0.14582254481268703 0)
        (0.5701982024507413 0.148297001672981 0)
        (0.5383340476025872 0.15061295758461507 0)
        (0.5062878988739442 0.15274211584806735 0)
        (0.47417503298433566 0.15465475315485241 0)
        (0.4421095501811808 0.15632185769950951 0)
        (0.41021017532077864 0.15771287518064214 0)
        (0.37859041339948496 0.1588009074560339 0)
        (0.34736048832212135 0.15955754223308236 0)
        (0.3166316902734701 0.15995759394007686 0)
        (0.28650981719932406 0.15997819888680884 0)
        (0.2570988069283761 0.15959851111307152 0)
    )
    polyLine 30 33
    (
        (1.0128830417923043 0.10043143849771013 1)
        (1.0098766031911464 0.10085248953654893 1)
        (1.00487582744531 0.10154869766650595 1)
        (0.9979063623920071 0.10251191105013269 1)
        (0.9890042262308285 0.10372979605267005 1)
        (0.9781976137475837 0.10519231319640823 1)
        (0.9655295662600601 0.10688217867195594 1)
        (0.9510525821965343 0.10878351370906257 1)
        (0.9348268800580242 0.11087601735791014 1)
        (0.9169184223384946 0.11314091881430258 1)
        (0.8973967079232174 0.11555740243490337 1)
        (0.8763394012251621 0.11810376049515617 1)
        (0.8538319532626815 0.12075882289512889 1)
        (0.8299586823961097 0.12350054802888694 1)
        (0.8048156602891436 0.12630668757223373 1)
        (0.7784953147364092 0.12915549664400391 1)
        (0.7511042451482106 0.13202264252960824 1)
        (0.7227423851616899 0.13488746897091727 1)
        (0.6935138593460537 0.1377243096412254 1)
        (0.6635354101045848 0.14050869577230643 1)
        (0.6329161988597679 0.14321699561439244 1)
        (0.6017646896443494 0.14582254481268703 1)
        (0.5701982024507413 0.148297001672981 1)
        (0.5383340476025872 0.15061295758461507 1)
        (0.5062878988739442 0.15274211584806735 1)
        (0.47417503298433566 0.15465475315485241 1)
        (0.4421095501811808 0.15632185769950951 1)
        (0.41021017532077864 0.15771287518064214 1)
        (0.37859041339948496 0.1588009074560339 1)
        (0.34736048832212135 0.15955754223308236 1)
        (0.3166316902734701 0.15995759394007686 1)
        (0.28650981719932406 0.15997819888680884 1)
        (0.2570988069283761 0.15959851111307152 1)
    )
    polyLine 14 18
    (
        (0.2284960626016534 0.1588015050450097 0)
        (0.20078766511003393 0.15757242316163617 0)
        (0.17405825570530412 0.1558983115830287 0)
        (0.1483792613755494 0.15376923419091298 0)
        (0.12380412616238741 0.15117479190414324 0)
        (0.10036759382643272 0.1480993444600717 0)
        (0.07808759142781631 0.1445227861679569 0)
        (0.056937681404144014 0.1404069233877016 0)
        (0.036842548193506575 0.1356824340945246 0)
        (0.017656707056910727 0.1302191276929993 0)
        (-0.0008562302843051137 0.12378048314157444 0)
        (-0.01906893389346946 0.11591625852625266 0)
        (-0.0375061565230132 0.10575353930345127 0)
        (-0.056665162104396344 0.09162253862781489 0)
        (-0.07623436531657704 0.0706467818202278 0)
        (-0.09303338558145142 0.03958222568427627 0)
        (-0.09843933956416974 0.017598193832609226 0)
    )
    polyLine 33 37
    (
        (0.2284960626016534 0.1588015050450097 1)
        (0.20078766511003393 0.15757242316163617 1)
        (0.17405825570530412 0.1558983115830287 1)
        (0.1483792613755494 0.15376923419091298 1)
        (0.12380412616238741 0.15117479190414324 1)
        (0.10036759382643272 0.1480993444600717 1)
        (0.07808759142781631 0.1445227861679569 1)
        (0.056937681404144014 0.1404069233877016 1)
        (0.036842548193506575 0.1356824340945246 1)
        (0.017656707056910727 0.1302191276929993 1)
        (-0.0008562302843051137 0.12378048314157444 1)
        (-0.01906893389346946 0.11591625852625266 1)
        (-0.0375061565230132 0.10575353930345127 1)
        (-0.056665162104396344 0.09162253862781489 1)
        (-0.07623436531657704 0.0706467818202278 1)
        (-0.09303338558145142 0.03958222568427627 1)
        (-0.09843933956416974 0.017598193832609226 1)
    )
    polyLine 18 17
    (
        (-0.08659076774353848 -0.053792467732593656 0)
        (-0.07623436531657704 -0.0706467818202278 0)
        (-0.056665162104396344 -0.09162253862781489 0)
        (-0.0375061565230132 -0.10575353930345127 0)
        (-0.01906893389346946 -0.11591625852625266 0)
        (-0.0008562302843051137 -0.12378048314157444 0)
        (0.017656707056910727 -0.1302191276929993 0)
        (0.036842548193506575 -0.1356824340945246 0)
        (0.056937681404144014 -0.1404069233877016 0)
        (0.07808759142781631 -0.1445227861679569 0)
        (0.10036759382643272 -0.1480993444600717 0)
        (0.12380412616238741 -0.15117479190414324 0)
        (0.1483792613755494 -0.15376923419091298 0)
        (0.17405825570530412 -0.1558983115830287 0)
        (0.20078766511003393 -0.15757242316163617 0)
        (0.2284960626016534 -0.1588015050450097 0)
    )
    polyLine 37 36
    (
        (-0.08659076774353848 -0.053792467732593656 1)
        (-0.07623436531657704 -0.0706467818202278 1)
        (-0.056665162104396344 -0.09162253862781489 1)
        (-0.0375061565230132 -0.10575353930345127 1)
        (-0.01906893389346946 -0.11591625852625266 1)
        (-0.0008562302843051137 -0.12378048314157444 1)
        (0.017656707056910727 -0.1302191276929993 1)
        (0.036842548193506575 -0.1356824340945246 1)
        (0.056937681404144014 -0.1404069233877016 1)
        (0.07808759142781631 -0.1445227861679569 1)
        (0.10036759382643272 -0.1480993444600717 1)
        (0.12380412616238741 -0.15117479190414324 1)
        (0.1483792613755494 -0.15376923419091298 1)
        (0.17405825570530412 -0.1558983115830287 1)
        (0.20078766511003393 -0.15757242316163617 1)
        (0.2284960626016534 -0.1588015050450097 1)
    )
    polyLine 17 13
    (
        (0.2570988069283761 -0.15959851111307152 0)
        (0.28650981719932406 -0.15997819888680884 0)
        (0.3166316902734701 -0.15995759394007686 0)
        (0.34736048832212135 -0.15955754223308236 0)
        (0.37859041339948496 -0.1588009074560339 0)
        (0.41021017532077864 -0.15771287518064214 0)
        (0.4421095501811808 -0.15632185769950951 0)
        (0.47417503298433566 -0.15465475315485241 0)
        (0.5062878988739442 -0.15274211584806735 0)
        (0.5383340476025872 -0.15061295758461507 0)
        (0.5701982024507413 -0.148297001672981 0)
        (0.6017646896443494 -0.14582254481268703 0)
        (0.6329161988597679 -0.14321699561439244 0)
        (0.6635354101045848 -0.14050869577230643 0)
        (0.6935138593460537 -0.1377243096412254 0)
        (0.7227423851616899 -0.13488746897091727 0)
        (0.7511042451482106 -0.13202264252960824 0)
        (0.7784953147364092 -0.12915549664400391 0)
        (0.8048156602891436 -0.12630668757223373 0)
        (0.8299586823961097 -0.12350054802888694 0)
        (0.8538319532626815 -0.12075882289512889 0)
        (0.8763394012251621 -0.11810376049515617 0)
        (0.8973967079232174 -0.11555740243490337 0)
        (0.9169184223384946 -0.11314091881430258 0)
        (0.9348268800580242 -0.11087601735791014 0)
        (0.9510525821965343 -0.10878351370906257 0)
        (0.9655295662600601 -0.10688217867195594 0)
        (0.9781976137475837 -0.10519231319640823 0)
        (0.9890042262308285 -0.10372979605267005 0)
        (0.9979063623920071 -0.10251191105013269 0)
        (1.00487582744531 -0.10154869766650595 0)
        (1.0098766031911464 -0.10085248953654893 0)
        (1.0128830417923043 -0.10043143849771013 0)
    )
    polyLine 36 32
    (
        (0.2570988069283761 -0.15959851111307152 1)
        (0.28650981719932406 -0.15997819888680884 1)
        (0.3166316902734701 -0.15995759394007686 1)
        (0.34736048832212135 -0.15955754223308236 1)
        (0.37859041339948496 -0.1588009074560339 1)
        (0.41021017532077864 -0.15771287518064214 1)
        (0.4421095501811808 -0.15632185769950951 1)
        (0.47417503298433566 -0.15465475315485241 1)
        (0.5062878988739442 -0.15274211584806735 1)
        (0.5383340476025872 -0.15061295758461507 1)
        (0.5701982024507413 -0.148297001672981 1)
        (0.6017646896443494 -0.14582254481268703 1)
        (0.6329161988597679 -0.14321699561439244 1)
        (0.6635354101045848 -0.14050869577230643 1)
        (0.6935138593460537 -0.1377243096412254 1)
        (0.7227423851616899 -0.13488746897091727 1)
        (0.7511042451482106 -0.13202264252960824 1)
        (0.7784953147364092 -0.12915549664400391 1)
        (0.8048156602891436 -0.12630668757223373 1)
        (0.8299586823961097 -0.12350054802888694 1)
        (0.8538319532626815 -0.12075882289512889 1)
        (0.8763394012251621 -0.11810376049515617 1)
        (0.8973967079232174 -0.11555740243490337 1)
        (0.9169184223384946 -0.11314091881430258 1)
        (0.9348268800580242 -0.11087601735791014 1)
        (0.9510525821965343 -0.10878351370906257 1)
        (0.9655295662600601 -0.10688217867195594 1)
        (0.9781976137475837 -0.10519231319640823 1)
        (0.9890042262308285 -0.10372979605267005 1)
        (0.9979063623920071 -0.10251191105013269 1)
        (1.00487582744531 -0.10154869766650595 1)
        (1.0098766031911464 -0.10085248953654893 1)
        (1.0128830417923043 -0.10043143849771013 1)
    )
    spline 12 15
    (
        (0.999013 0.001398 0)
        (0.996057 0.001812 0)
        (0.991144 0.002496 0)
        (0.984292 0.003443 0)
        (0.975528 0.004642 0)
        (0.964888 0.006082 0)
        (0.952414 0.007746 0)
        (0.938153 0.009619 0)
        (0.922164 0.011681 0)
        (0.904508 0.013914 0)
        (0.885257 0.016297 0)
        (0.864484 0.018809 0)
        (0.842274 0.021429 0)
        (0.818712 0.024135 0)
        (0.793893 0.026905 0)
        (0.767913 0.029717 0)
        (0.740877 0.032547 0)
        (0.71289 0.035374 0)
        (0.684062 0.038172 0)
        (0.654508 0.040917 0)
        (0.624345 0.043585 0)
        (0.593691 0.046149 0)
        (0.562667 0.048581 0)
        (0.531395 0.050854 0)
        (0.5 0.05294 0)
        (0.468605 0.05481 0)
        (0.437333 0.056436 0)
        (0.406309 0.057789 0)
        (0.375655 0.058844 0)
        (0.345492 0.059575 0)
        (0.315938 0.05996 0)
        (0.28711 0.05998 0)
        (0.259123 0.059619 0)
    )
    spline 31 34
    (
        (0.999013 0.001398 1)
        (0.996057 0.001812 1)
        (0.991144 0.002496 1)
        (0.984292 0.003443 1)
        (0.975528 0.004642 1)
        (0.964888 0.006082 1)
        (0.952414 0.007746 1)
        (0.938153 0.009619 1)
        (0.922164 0.011681 1)
        (0.904508 0.013914 1)
        (0.885257 0.016297 1)
        (0.864484 0.018809 1)
        (0.842274 0.021429 1)
        (0.818712 0.024135 1)
        (0.793893 0.026905 1)
        (0.767913 0.029717 1)
        (0.740877 0.032547 1)
        (0.71289 0.035374 1)
        (0.684062 0.038172 1)
        (0.654508 0.040917 1)
        (0.624345 0.043585 1)
        (0.593691 0.046149 1)
        (0.562667 0.048581 1)
        (0.531395 0.050854 1)
        (0.5 0.05294 1)
        (0.468605 0.05481 1)
        (0.437333 0.056436 1)
        (0.406309 0.057789 1)
        (0.375655 0.058844 1)
        (0.345492 0.059575 1)
        (0.315938 0.05996 1)
        (0.28711 0.05998 1)
        (0.259123 0.059619 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.232087 0.058866 0)
        (0.206107 0.057714 0)
        (0.181288 0.05616 0)
        (0.157726 0.054207 0)
        (0.135516 0.051863 0)
        (0.114743 0.049138 0)
        (0.095492 0.046049 0)
        (0.077836 0.042615 0)
        (0.061847 0.038859 0)
        (0.047586 0.034803 0)
        (0.035112 0.030473 0)
        (0.024472 0.025893 0)
        (0.015708 0.021088 0)
        (0.008856 0.016078 0)
        (0.003943 0.010884 0)
        (0.000987 0.005521 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.232087 0.058866 1)
        (0.206107 0.057714 1)
        (0.181288 0.05616 1)
        (0.157726 0.054207 1)
        (0.135516 0.051863 1)
        (0.114743 0.049138 1)
        (0.095492 0.046049 1)
        (0.077836 0.042615 1)
        (0.061847 0.038859 1)
        (0.047586 0.034803 1)
        (0.035112 0.030473 1)
        (0.024472 0.025893 1)
        (0.015708 0.021088 1)
        (0.008856 0.016078 1)
        (0.003943 0.010884 1)
        (0.000987 0.005521 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.000987 -0.005521 0)
        (0.003943 -0.010884 0)
        (0.008856 -0.016078 0)
        (0.015708 -0.021088 0)
        (0.024472 -0.025893 0)
        (0.035112 -0.030473 0)
        (0.047586 -0.034803 0)
        (0.061847 -0.038859 0)
        (0.077836 -0.042615 0)
        (0.095492 -0.046049 0)
        (0.114743 -0.049138 0)
        (0.135516 -0.051863 0)
        (0.157726 -0.054207 0)
        (0.181288 -0.05616 0)
        (0.206107 -0.057714 0)
        (0.232087 -0.058866 0)
    )
    spline 19 35
    (
        (0.000987 -0.005521 1)
        (0.003943 -0.010884 1)
        (0.008856 -0.016078 1)
        (0.015708 -0.021088 1)
        (0.024472 -0.025893 1)
        (0.035112 -0.030473 1)
        (0.047586 -0.034803 1)
        (0.061847 -0.038859 1)
        (0.077836 -0.042615 1)
        (0.095492 -0.046049 1)
        (0.114743 -0.049138 1)
        (0.135516 -0.051863 1)
        (0.157726 -0.054207 1)
        (0.181288 -0.05616 1)
        (0.206107 -0.057714 1)
        (0.232087 -0.058866 1)
    )
    spline 16 12
    (
        (0.259123 -0.059619 0)
        (0.28711 -0.05998 0)
        (0.315938 -0.05996 0)
        (0.345492 -0.059575 0)
        (0.375655 -0.058844 0)
        (0.406309 -0.057789 0)
        (0.437333 -0.056436 0)
        (0.468605 -0.05481 0)
        (0.5 -0.05294 0)
        (0.531395 -0.050854 0)
        (0.562667 -0.048581 0)
        (0.593691 -0.046149 0)
        (0.624345 -0.043585 0)
        (0.654508 -0.040917 0)
        (0.684062 -0.038172 0)
        (0.71289 -0.035374 0)
        (0.740877 -0.032547 0)
        (0.767913 -0.029717 0)
        (0.793893 -0.026905 0)
        (0.818712 -0.024135 0)
        (0.842274 -0.021429 0)
        (0.864484 -0.018809 0)
        (0.885257 -0.016297 0)
        (0.904508 -0.013914 0)
        (0.922164 -0.011681 0)
        (0.938153 -0.009619 0)
        (0.952414 -0.007746 0)
        (0.964888 -0.006082 0)
        (0.975528 -0.004642 0)
        (0.984292 -0.003443 0)
        (0.991144 -0.002496 0)
        (0.996057 -0.001812 0)
        (0.999013 -0.001398 0)
    )
    spline 35 31
    (
        (0.259123 -0.059619 1)
        (0.28711 -0.05998 1)
        (0.315938 -0.05996 1)
        (0.345492 -0.059575 1)
        (0.375655 -0.058844 1)
        (0.406309 -0.057789 1)
        (0.437333 -0.056436 1)
        (0.468605 -0.05481 1)
        (0.5 -0.05294 1)
        (0.531395 -0.050854 1)
        (0.562667 -0.048581 1)
        (0.593691 -0.046149 1)
        (0.624345 -0.043585 1)
        (0.654508 -0.040917 1)
        (0.684062 -0.038172 1)
        (0.71289 -0.035374 1)
        (0.740877 -0.032547 1)
        (0.767913 -0.029717 1)
        (0.793893 -0.026905 1)
        (0.818712 -0.024135 1)
        (0.842274 -0.021429 1)
        (0.864484 -0.018809 1)
        (0.885257 -0.016297 1)
        (0.904508 -0.013914 1)
        (0.922164 -0.011681 1)
        (0.938153 -0.009619 1)
        (0.952414 -0.007746 1)
        (0.964888 -0.006082 1)
        (0.975528 -0.004642 1)
        (0.984292 -0.003443 1)
        (0.991144 -0.002496 1)
        (0.996057 -0.001812 1)
        (0.999013 -0.001398 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
