OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "../Inputs"
application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      2;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;


functions
{
   
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (airfoil);
        rho             rhoInf;
        rhoInf          $RHOINF;
        CofR            (0 0 0);
        liftDir         ($LX $LZ 0);
        dragDir         ($DX $DZ 0);
        pitchAxis       (0 0 1);
        magUInf         $UINF;
        lRef            $CHR;
        Aref            $CHR;
        writeControl    timeStep;
        timeInterval    1;
        log             yes;
    }

}


// ************************************************************************* //
