OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync                false;

patches
(
    {
        name             freestream;
        patchInfo
        {
            type         patch;
        }
        constructFrom    patches;
        patches          (auto0 auto4);
    }
    {
        name             airfoil;
        patchInfo
        {
            type         wall;
        }
        constructFrom    patches;
        patches          (auto3);
    }
    {
        name             leftAndRight;
        patchInfo
        {
            type         empty;
        }
        constructFrom    patches;
        patches          (auto1 auto2);
    }
);


// ************************************************************************* //
