OpenFOAM_Benchmarks/NACA0012_Airfoil/baseCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
    grad(p)             Gauss linear;
    unlimitedGrad(U)    Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwindV unlimitedGrad(U);

    turbulence          bounded Gauss limitedLinear 1.0;

    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,nuTilda)    $turbulence;
    div(phi,epsilon)    $turbulence;
    div(phi,phit)       $turbulence;
    div(phi,f)          $turbulence;
    div(phi,gammaInt)   bounded Gauss linearUpwind grad;
    div(phi,ReThetat)   bounded Gauss linearUpwind grad;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
